scripts/testfstrucutre/small_structure/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    box
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          33792;
        startFace       769024;
    }
    outlet
    {
        type            patch;
        nFaces          1024;
        startFace       802816;
    }
)

// ************************************************************************* //
